---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotKeepReferenceOfJoinedElement
source: html/fc8406bd-fa36-78cb-68e0-c9870198a6be.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotKeepReferenceOfJoinedElement Property

Can't keep reference of joined element.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotKeepReferenceOfJoinedElement { get; }
```